DigiFennek/TransputerBox/MCUXpresso/transputerBox_WinUSB_cm4/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitPins(void)
{
    /* Enables the clock for the input muxes. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_2 (pin 36)  */
    GPIO_PinInit(BOARD_RESET_GPIO, BOARD_RESET_PORT, BOARD_RESET_PIN, &RESET_config);

    gpio_pin_config_t PON_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_3 (pin 37)  */
    GPIO_PinInit(BOARD_PON_GPIO, BOARD_PON_PORT, BOARD_PON_PIN, &PON_config);

    gpio_pin_config_t LINK_SPEED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_5 (pin 39)  */
    GPIO_PinInit(BOARD_LINK_SPEED_GPIO, BOARD_LINK_SPEED_PORT, BOARD_LINK_SPEED_PIN, &LINK_SPEED_config);

    gpio_pin_config_t TEST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 40)  */
    GPIO_PinInit(BOARD_TEST_GPIO, BOARD_TEST_PORT, BOARD_TEST_PIN, &TEST_config);

    gpio_pin_config_t C012_D0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin 41)  */
    GPIO_PinInit(BOARD_C012_D0_GPIO, BOARD_C012_D0_PORT, BOARD_C012_D0_PIN, &C012_D0_config);

    gpio_pin_config_t C012_D1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin 43)  */
    GPIO_PinInit(BOARD_C012_D1_GPIO, BOARD_C012_D1_PORT, BOARD_C012_D1_PIN, &C012_D1_config);

    gpio_pin_config_t C012_D2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin 44)  */
    GPIO_PinInit(BOARD_C012_D2_GPIO, BOARD_C012_D2_PORT, BOARD_C012_D2_PIN, &C012_D2_config);

    gpio_pin_config_t C012_D3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin 45)  */
    GPIO_PinInit(BOARD_C012_D3_GPIO, BOARD_C012_D3_PORT, BOARD_C012_D3_PIN, &C012_D3_config);

    gpio_pin_config_t C012_D4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_11 (pin 46)  */
    GPIO_PinInit(BOARD_C012_D4_GPIO, BOARD_C012_D4_PORT, BOARD_C012_D4_PIN, &C012_D4_config);

    gpio_pin_config_t C012_D5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin 47)  */
    GPIO_PinInit(BOARD_C012_D5_GPIO, BOARD_C012_D5_PORT, BOARD_C012_D5_PIN, &C012_D5_config);

    gpio_pin_config_t C012_D6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 48)  */
    GPIO_PinInit(BOARD_C012_D6_GPIO, BOARD_C012_D6_PORT, BOARD_C012_D6_PIN, &C012_D6_config);

    gpio_pin_config_t C012_D7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin 49)  */
    GPIO_PinInit(BOARD_C012_D7_GPIO, BOARD_C012_D7_PORT, BOARD_C012_D7_PIN, &C012_D7_config);

    gpio_pin_config_t C012_RS0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 58)  */
    GPIO_PinInit(BOARD_C012_RS0_GPIO, BOARD_C012_RS0_PORT, BOARD_C012_RS0_PIN, &C012_RS0_config);

    gpio_pin_config_t C012_RS1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 59)  */
    GPIO_PinInit(BOARD_C012_RS1_GPIO, BOARD_C012_RS1_PORT, BOARD_C012_RS1_PIN, &C012_RS1_config);

    gpio_pin_config_t C012_RNOTW_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin 60)  */
    GPIO_PinInit(BOARD_C012_RNOTW_GPIO, BOARD_C012_RNOTW_PORT, BOARD_C012_RNOTW_PIN, &C012_RNOTW_config);

    gpio_pin_config_t DEBUG_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 61)  */
    GPIO_PinInit(BOARD_DEBUG_GPIO, BOARD_DEBUG_PORT, BOARD_DEBUG_PIN, &DEBUG_config);

    gpio_pin_config_t C012_NOTCS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 63)  */
    GPIO_PinInit(BOARD_C012_NOTCS_GPIO, BOARD_C012_NOTCS_PORT, BOARD_C012_NOTCS_PIN, &C012_NOTCS_config);

    gpio_pin_config_t C012_OUTPUT_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 1)  */
    GPIO_PinInit(BOARD_C012_OUTPUT_INT_GPIO, BOARD_C012_OUTPUT_INT_PORT, BOARD_C012_OUTPUT_INT_PIN, &C012_OUTPUT_INT_config);

    gpio_pin_config_t C012_INPUT_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_24 (pin 2)  */
    GPIO_PinInit(BOARD_C012_INPUT_INT_GPIO, BOARD_C012_INPUT_INT_PORT, BOARD_C012_INPUT_INT_PIN, &C012_INPUT_INT_config);

    gpio_pin_config_t C012_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin 3)  */
    GPIO_PinInit(BOARD_C012_RESET_GPIO, BOARD_C012_RESET_PORT, BOARD_C012_RESET_PIN, &C012_RESET_config);

    gpio_pin_config_t BUTTON_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_31 (pin 13)  */
    GPIO_PinInit(BOARD_BUTTON_GPIO, BOARD_BUTTON_PORT, BOARD_BUTTON_PIN, &BUTTON_config);

    gpio_pin_config_t FAN_TACHO_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 14)  */
    GPIO_PinInit(BOARD_FAN_TACHO_1_GPIO, BOARD_FAN_TACHO_1_PORT, BOARD_FAN_TACHO_1_PIN, &FAN_TACHO_1_config);

    gpio_pin_config_t FAN_TACHO_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin 15)  */
    GPIO_PinInit(BOARD_FAN_TACHO_2_GPIO, BOARD_FAN_TACHO_2_PORT, BOARD_FAN_TACHO_2_PIN, &FAN_TACHO_2_config);

    gpio_pin_config_t LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin 17)  */
    GPIO_PinInit(BOARD_LED_GPIO, BOARD_LED_PORT, BOARD_LED_PIN, &LED_config);

    gpio_pin_config_t ERROR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 29)  */
    GPIO_PinInit(BOARD_ERROR_GPIO, BOARD_ERROR_PORT, BOARD_ERROR_PIN, &ERROR_config);

